In [8]:
import pandas as pd

url = 'https://gist.githubusercontent.com/guilhermesilveira/4d1d4a16ccbf6ea4e0a64a38a24ec884/raw/afd05cb0c796d18f3f5a6537053ded308ba94bf7/car-prices.csv'

data = pd.read_csv(url)
data.head()

   Unnamed: 0  mileage_per_year  model_year      price sold
0           0             21801        2000   30941.02  yes
1           1              7843        1998   40557.96  yes
2           2              7109        2006   89627.50   no
3           3             26823        2015   95276.14   no
4           4              7935        2014  117384.68  yes

In [9]:
renomear = {
    'mileage_per_year' : 'milhas_por_ano',
    'model_year' : 'ano_modelo',
    'price' : 'preco',
    'sold' : 'vendido'
}
data = data.rename(columns= renomear)
data.head()

   Unnamed: 0  milhas_por_ano  ano_modelo      preco vendido
0           0           21801        2000   30941.02     yes
1           1            7843        1998   40557.96     yes
2           2            7109        2006   89627.50      no
3           3           26823        2015   95276.14      no
4           4            7935        2014  117384.68     yes

In [10]:
dicionario = {
    'yes': 1,
    'no' : 0
}

data.vendido = data.vendido.map(dicionario)
data.head()

   Unnamed: 0  milhas_por_ano  ano_modelo      preco  vendido
0           0           21801        2000   30941.02        1
1           1            7843        1998   40557.96        1
2           2            7109        2006   89627.50        0
3           3           26823        2015   95276.14        0
4           4            7935        2014  117384.68        1

In [13]:
from datetime import datetime

ano_atual = datetime.today().year

data['idade_modelo'] = ano_atual - data.ano_modelo

data.head()

   Unnamed: 0  milhas_por_ano  ano_modelo      preco  vendido  idade_modelo
0           0           21801        2000   30941.02        1            21
1           1            7843        1998   40557.96        1            23
2           2            7109        2006   89627.50        0            15
3           3           26823        2015   95276.14        0             6
4           4            7935        2014  117384.68        1             7

In [15]:
km = 1.60934

data['km_por_ano'] = data.milhas_por_ano * km
data.head()

,Unnamed: 0,milhas_por_ano,ano_modelo,preco,vendido,idade_modelo,km_por_ano
0,0,21801,2000,30941.02,1,21,35085.22134
1,1,7843,1998,40557.96,1,23,12622.05362
2,2,7109,2006,89627.50,0,15,11440.79806
3,3,26823,2015,95276.14,0,6,43167.32682
4,4,7935,2014,117384.68,1,7,12770.11290

In [16]:
data = data.drop(columns=['Unnamed: 0', 'milhas_por_ano', 'ano_modelo'], axis = 1)
data.head()

       preco  vendido  idade_modelo   km_por_ano
0   30941.02        1            21  35085.22134
1   40557.96        1            23  12622.05362
2   89627.50        0            15  11440.79806
3   95276.14        0             6  43167.32682
4  117384.68        1             7  12770.11290

In [19]:
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.svm import LinearSVC
from sklearn.metrics import accuracy_score

x = data[['preco', 'idade_modelo', 'km_por_ano']]
y = data['vendido']

SEED = 5
np.random.seed(SEED)
treino_x, teste_x, treino_y, teste_y = train_test_split(x, y, test_size = 0.25, stratify = y)
print("Treinaremos com %d elementos e testaremos com %d elementos" % (len(treino_x), len(teste_x)))

modelo = LinearSVC()
modelo.fit(treino_x, treino_y)
previsoes = modelo.predict(teste_x)

acuracia = accuracy_score(teste_y, previsoes) * 100
print("A acurácia foi %.2f%%" % acuracia)

Treinaremos com 7500 elementos e testaremos com 2500 elementos
A acurácia foi 58.00%

C:\Users\Rado\anaconda3\envs\estudos\lib\site-packages\sklearn\svm\_base.py:1206: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  warnings.warn(